
# numbers = [-2, -4, -5, 20, 18]
# res = sum(filter(lambda x: x < 0, numbers))
# print(res)

# for i in range(10):
#
#     a[i] = i
#
# или даже короче:
#
# a = [i for i in range(10)]
#
# "Конструкция, записанная
# в квадратных скобках,
# и является генератором списка

# Если нам необходимо принять данные от пользователя,
# a=[0]*10 #предварительно заводим место под массив, присвоив значения всем элементам 0
#
# for i in range(10):
# a[i] = int (input('Введите значение очередного элемента списка '))